{
  "backend/main.mo": "Empty Motoko actor placeholder with no functionality.",
  "feature_evidence.json": "Feature evidence listing footer text update and creation of a deployment guide with associated files and metadata.",
  "frontend-file-summaries.txt": "Collection of autogenerated 1–2 sentence summaries for all frontend files and components.",
  "frontend/DEPLOYMENT.md": "Step-by-step guide for local setup and mainnet deployment of the portfolio app on the Internet Computer.",
  "frontend/index.css": "Tailwind base configuration defining global CSS variables and dark mode color tokens.",
  "frontend/index.html": "HTML entry point providing root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app enabling dark mode and rendering all portfolio sections with the footer.",
  "frontend/src/components/portfolio/AboutSection.tsx": "About section displaying a personal summary inside animated card components.",
  "frontend/src/components/portfolio/CertificationsSection.tsx": "Certifications list rendered as animated cards with award icons.",
  "frontend/src/components/portfolio/ContactSection.tsx": "Contact info and mailto-based contact form with validation and animated layout.",
  "frontend/src/components/portfolio/Footer.tsx": "Footer with social links, fixed © 2026 text, and caffeine.ai attribution.",
  "frontend/src/components/portfolio/HeroSection.tsx": "Hero banner with background image, name, tagline, and smooth-scrolling CTA button.",
  "frontend/src/components/portfolio/Navbar.tsx": "Responsive navbar with active-section tracking, smooth scrolling, and mobile sheet menu.",
  "frontend/src/components/portfolio/ProjectsSection.tsx": "Renders a grid of project cards using project data with reveal animations and GitHub links.",
  "frontend/src/components/portfolio/ResumeSection.tsx": "Displays a resume download card with placeholder download logic and reveal effects.",
  "frontend/src/components/portfolio/Reveal.tsx": "IntersectionObserver-based component that animates children into view unless reduced motion is preferred.",
  "frontend/src/components/portfolio/Section.tsx": "Wrapper section component adding layout padding and a subtle patterned background.",
  "frontend/src/components/portfolio/SkillsSection.tsx": "Shows categorized skills with badges and reveal animations within a styled section.",
  "frontend/src/components/portfolio/VideoSection.tsx": "Placeholder video section rendering a card indicating upcoming video content.",
  "frontend/src/data/projects.ts": "Exports typed project list defining titles, descriptions, tech stacks, and GitHub links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication via AuthClient.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting user preference for reduced motion via media query.",
  "frontend/src/index.css": "Defines Tailwind layers with CSS variables for light/dark themes and utility classes like gradient text and borders.",
  "frontend/src/lib/utils.ts": "Exports a helper function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors bound to CSS variables, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature list, and design requirements for a portfolio website."
}